Revit 2027 API
BumpMap.BumpmapDepth Property
 The property labeled "Amount" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string BumpmapDepth { get; }
Public Shared ReadOnly Property BumpmapDepth As String
	Get
public:
static property String^ BumpmapDepth {
	String^ get ();
}
static member BumpmapDepth : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace